Revit 2024 API
MEPSystem.GetCriticalPathSectionNumbers Method
 Obtains a list of the critical path section numbers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public IList<int> GetCriticalPathSectionNumbers()
Visual Basic
Public Function GetCriticalPathSectionNumbers As IList(Of Integer)
Visual C++
public:
IList<int>^ GetCriticalPathSectionNumbers()
Return Value
 The section numbers.
Remarks
 The section numbers are returned in order in the direction of flow.
See Also
MEPSystem Class
Autodesk.Revit.DB Namespace